{
    "architectures": [
      "Bert"
    ],
    "model_type": "bert",
    "attention_probs_dropout_prob": 0.1,
    "hidden_act": "gelu",
    "hidden_dropout_prob": 0.1,
    "embedding_dim": 768,
    "hidden_size": 768,
    "initializer_range": 0.02,
    "intermediate_size": 3072,
    "const_size": 128,
    "max_role_embeddings": 4,
    "num_attention_heads": 12,
    "span_num_heads": 12,
    "type_vocab_size": 2,
    "vocab_size": 30522,
    "encoder_num_hidden_layers": 1,
    "pad_token_id": 0,
    "bos_token_id": 4,
    "eos_token_id": 5,
    "cls_token_id": 101,
    "sum_token_id": 7,
    "mask_token_id": 103,
    "nsp_token_id": 8,
    "lr_token_id": 9,
    "rr_token_id": 10,
    "eot_token_id": 11,
    "tree_mask_token_id": 12,
    "policy_token_id": 6,
    "window_size": 2,
    "iter_times":3,
    "span_attention_num_layers": 3,
    "enable_self_attention": true,
    "parser_hidden_dim": 256,
    "parser_input_dim": 128,
    "parser_num_layers": 4
  }