{
    "architectures": [
      "Bert"
    ],
    "attention_probs_dropout_prob": 0.1,
    "directionality": "bidi",
    "hidden_act": "gelu",
    "hidden_dropout_prob": 0.1,
    "embedding_dim": 768,
    "hidden_size": 768,
    "initializer_range": 0.02,
    "intermediate_size": 3072,
    "layer_norm_eps": 1e-12,
    "max_role_embeddings": 3,
    "model_type": "bert",
    "num_attention_heads": 12,
    "encoder_num_hidden_layers": 3,
    "pad_token_id": 0,
    "bos_token_id": 2,
    "eos_token_id": 3,
    "cls_token_id": 101,
    "sum_token_id": 5,
    "mask_token_id": 103,
    "nsp_token_id": 6,
    "eot_token_id": 7,
    "tree_mask_token_id": 8,
    "policy_token_id": 4,
    "pooler_fc_size": 768,
    "pooler_num_attention_heads": 12,
    "pooler_num_fc_layers": 3,
    "pooler_size_per_head": 128,
    "pooler_type": "first_token_transform",
    "type_vocab_size": 2,
    "vocab_size": 21128,
    "window_size": 4,
    "tie_decoder": false,
    "parser_hidden_dim": 256,
    "parser_input_dim": 128,
    "parser_num_layers": 3
  }
  